// clang-format off
#include <stdio.h>
#include <stdlib.h>
#include <fcntl.h>
#include <io.h>
#include <locale.h>
#include <wchar.h>

#include "structures.c"
#include "debug.c" //To debug μπορεί να αφεραιθεί, αλλά ο compiler βγάζει error επειδή το debug δεν θα έχει πρόσβαση στο structures.

#include "deck.c"
#include "bet.c"
#include "drawCard.c"
#include "drawScreen.c"
#include "turns.c"
#include "newRound.c"
// clang-format on

/* Κανόνες παιχνιδιού:
    Το παιχνίδι ξεκινάει με μία κλασσική τράπουλα 52 καρτών και παίζεται ανάμεσα
    στον παίκτη/χρήστη του προγράμματος και της μηχανής, που αναλαμβάνει τον ρόλο του οίκου.

    Ο παίκτης και ο οίκος ξεκινάνε με 100$ ο καθένας. Στην αρχή του γύρου ο παίκτης διαλέγει ένα ποσό
    για να ποντάρει και τραβάει 2 κάρτες. Εφόσον το σύνολο των καρτών που έχει τραβήξει είναι μικρότερος
    απο 21, ο παίκτης έχει την επιλογή να αυξήσει (αν θέλει) το ποντάρισμα του και να τραβήξει ξανά.

    Όσον αφορά την αξία των καρτών, Οι αριθμοί αξίζουν τον αριθμό που φέρουν, όλες οι φιγούρες είναι ίσες με 10,
    ενώ οι άσοι αξίζουν 1 ή 11 σύμφωνα με την επιλογή του παίκτη.

    Αν ο παίκτης υπερβεί το 21 ως αξία και καεί, αυτό μετράει ως αυτόματη νίκη του οίκου.

    Αν ο παίκτης επιλέξει να σταματήσει να τραβάει νέες κάρτες, έρχεται η σειρά του οίκου να τραβήξει.

    Συγκρίνουμε τις αξίες των δύο χεριών για να βρουμε τον νικητή. Η ισοψηφία μετράει ως νίκη του οίκου.
    Προφανώς αν καεί οι οίκος μετράμε μία ακόμα νίκη του παίκτη.

    Στο τέλος του γύρου, ο ηττημένος δίνει στον νικητή ένα ποσό ίσο του τελικού πονταρίσματος.

    Με τα το τέλος του γύρου, εφόσον και οι δύο παίκτες έχουν αρκετά χρήματα για να συνεχίσουν,
    ο παίκτης μπορεί να επιλέξει να συνεχίσει στον επόμενο γύρο.
*/

int main() {
    _setmode(_fileno(stdout), 0x00020000);  // Αλλάζουμε το mode των χαρακτήρων που κάνουμε print σε Unicode.
    setlocale(LC_CTYPE, "");                // Αυτό νομίζω κάνει κάτι για να βρίσκει τα hex id των χαρακτήρων στο Unicode.
    // Για αυτόν τον λόγο χρησιμοποιούμε wprintf(L) αντί για printf(). Το L δεν ξέρω τι σημαίνει.

    // Διαβάστε πρώτα το structures.c

    struct Card deck[52];

    initializeDeck(&deck[0]);
    shuffleDeck(&deck[0]);
    // Οι παραπάνω συναρτήσεις βρίσκονται στο αρχείο deck.c

    newRound(&deck[0]);
    // Βρίσκεται τελευταία στο αρχείο newRound.c

    return 0;
}